sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_lin.c
/*!
    \file    gd32a7xx_linflexd_lin.c
    \brief   LINFLEXD LIN driver

    \version 2025-08-06, V0.1.0, firmware for GD32A7xx
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32a7xx_linflexd_lin.h"

#define LINFlexD_IFMI_IFMI_MASK                                 (0x1FU)
#define LINFlexD_LINCR1_BF_MASK                                 (0x80U)
#define BAUDRATE_FRACTION_WIDTH                                 (0x04U)
#define LINFlexD_BIDR_SIZE_OFFSET                               (0x0AU)
#define LINFlexD_BIDR_ID_MASK                                   (0x3FU)
#define LINFLEXD_LIN_DELAY                                      (0xFFFFU)                /* infinite loop delay count */
#define DEFAULT_BAUDRATE                                        (19200U)                 /* default baud rate value */
#define DEFAULT_RES_TIMEOUT_VALUE                               (0x10U)                  /* default response timeout value */
#define DEFAULT_HEAD_TIMEOUT_VALUE                              (0x2FU)                  /* default head timeout value */
#define DEFAULT_FILTER_COUNT_VALUE                              (0x0U)                   /* default filter value */
#define DEFAULT_NUM_CLASSICID_VALUE                             (0x0U)                   /* default number of classic ID value */

/*!
    \brief      reset LIN Peripheral (API_ID(0x0001U))
    \param[in]  linflexdx: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     ErrStatus:SUCCESS or ERROR
*/
ErrStatus linflexd_deinit(uint32_t lin_periph)
{
    ErrStatus reval = SUCCESS;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0001U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t timeout_cnt;
        /* enter initialization mode */
        linflexd_lin_enter_init_mode(lin_periph);
        /* load delay count */
        timeout_cnt = LINFLEXD_LIN_DELAY;
        while ((linflexd_lin_get_state(lin_periph) != LINFlexD_STATE_INIT_MODE)  && (0U != timeout_cnt)) {
            timeout_cnt--;
        }
        if(linflexd_lin_get_state(lin_periph) != LINFlexD_STATE_INIT_MODE){
            /* set error status */
            reval = ERROR;
        } else {
            /* reset LINFlexD_LIN register */
            LINFLEXD_LINIER(lin_periph)      = 0x00000000U;
            LINFLEXD_LINSR(lin_periph)       = 0x00080327U;
            LINFLEXD_LINESR(lin_periph)      = 0x0000FF81U;
            LINFLEXD_LINTCSR(lin_periph)     = 0x00000200U;
            LINFLEXD_LINOCR(lin_periph)      = 0x0000FFFFU;
            LINFLEXD_LINTOCR(lin_periph)     = 0x00000E2CU;
            LINFLEXD_LINFBRR(lin_periph)     = 0x00000000U;
            LINFLEXD_LINIBRR(lin_periph)     = 0x00000000U;
            LINFLEXD_LINCFR(lin_periph)      = 0x00000000U;
            LINFLEXD_LINCR2(lin_periph)      = 0x00006000U;
            LINFLEXD_BIDR(lin_periph)        = 0x00000000U;
            LINFLEXD_BDRL(lin_periph)        = 0x00000000U;
            LINFLEXD_BDRM(lin_periph)        = 0x00000000U;
            LINFLEXD_IFER(lin_periph)        = 0x00000000U;
            LINFLEXD_IFMR(lin_periph)        = 0x00000000U;
            for(uint32_t i=0;i<=15U;i++){
                LINFLEXD_IFCR(lin_periph, i) = 0x00000000U;
            }
            LINFLEXD_GCR(lin_periph)         = 0x00000000U;
            LINFLEXD_DMATXE(lin_periph)      = 0x00000000U;
            LINFLEXD_DMARXE(lin_periph)      = 0x00000000U;
            LINFLEXD_LIN_STCTL(lin_periph)   = 0x00000000U;
            LINFLEXD_LINCR1(lin_periph)      = 0x00000081U;
            LINFLEXD_LINCR1(lin_periph)      = 0x00000082U;
            
        switch(lin_periph){
        case LINFLEXD_LIN0:
            /* perform software reset */
            LINFLEXD_GCR(lin_periph) |= LINFLEXD_GCR_SR;
            /* reset LIN0 */
            rcu_periph_reset_enable(RCU_LINFLEXD0RST);
            rcu_periph_reset_disable(RCU_LINFLEXD0RST);
            break;
        case LINFLEXD_LIN1:
            /* perform software reset */
            LINFLEXD_GCR(lin_periph) |= LINFLEXD_GCR_SR;
            /* reset LIN1 */
            rcu_periph_reset_enable(RCU_LINFLEXD1RST);
            rcu_periph_reset_disable(RCU_LINFLEXD1RST);
            break;
        case LINFLEXD_LIN2:
            /* perform software reset */
            LINFLEXD_GCR(lin_periph) |= LINFLEXD_GCR_SR;
            /* reset LIN2 */
            rcu_periph_reset_enable(RCU_LINFLEXD2RST);
            rcu_periph_reset_disable(RCU_LINFLEXD2RST);
            break;
        case LINFLEXD_LIN3:
            /* perform software reset */
            LINFLEXD_GCR(lin_periph) |= LINFLEXD_GCR_SR;
            /* reset LIN3 */
            rcu_periph_reset_enable(RCU_LINFLEXD3RST);
            rcu_periph_reset_disable(RCU_LINFLEXD3RST);
            break;
        case LINFLEXD_LIN4:
            /* perform software reset */
            LINFLEXD_GCR(lin_periph) |= LINFLEXD_GCR_SR;
            /* reset LIN4 */
            rcu_periph_reset_enable(RCU_LINFLEXD4RST);
            rcu_periph_reset_disable(RCU_LINFLEXD4RST);
            break;
        case LINFLEXD_LIN5:
            /* perform software reset */
            LINFLEXD_GCR(lin_periph) |= LINFLEXD_GCR_SR;
            /* reset LIN5 */
            rcu_periph_reset_enable(RCU_LINFLEXD5RST);
            rcu_periph_reset_disable(RCU_LINFLEXD5RST);
            break;
#if defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX)
        case LINFLEXD_LIN6:
            /* perform software reset */
            LINFLEXD_GCR(lin_periph) |= LINFLEXD_GCR_SR;
            /* reset LIN6 */
            rcu_periph_reset_enable(RCU_LINFLEXD6RST);
            rcu_periph_reset_disable(RCU_LINFLEXD6RST);
            break;
        case LINFLEXD_LIN7:
            /* perform software reset */
            LINFLEXD_GCR(lin_periph) |= LINFLEXD_GCR_SR;
            /* reset LIN7 */
            rcu_periph_reset_enable(RCU_LINFLEXD7RST);
            rcu_periph_reset_disable(RCU_LINFLEXD7RST);
            break;
        case LINFLEXD_LIN8:
            /* perform software reset */
            LINFLEXD_GCR(lin_periph) |= LINFLEXD_GCR_SR;
            /* reset LIN8 */
            rcu_periph_reset_enable(RCU_LINFLEXD8RST);
            rcu_periph_reset_disable(RCU_LINFLEXD8RST);
            break;
        case LINFLEXD_LIN9:
            /* perform software reset */
            LINFLEXD_GCR(lin_periph) |= LINFLEXD_GCR_SR;
            /* reset LIN9 */
            rcu_periph_reset_enable(RCU_LINFLEXD9RST);
            rcu_periph_reset_disable(RCU_LINFLEXD9RST);
            break;
        case LINFLEXD_LIN10:
            /* perform software reset */
            LINFLEXD_GCR(lin_periph) |= LINFLEXD_GCR_SR;
            /* reset LIN10 */
            rcu_periph_reset_enable(RCU_LINFLEXD10RST);
            rcu_periph_reset_disable(RCU_LINFLEXD10RST);
            break;
        case LINFLEXD_LIN11:
            /* perform software reset */
            LINFLEXD_GCR(lin_periph) |= LINFLEXD_GCR_SR;
            /* reset LIN11 */
            rcu_periph_reset_enable(RCU_LINFLEXD11RST);
            rcu_periph_reset_disable(RCU_LINFLEXD11RST);
            break;
#endif /* defined(GD32A714X) || defined (GD32A72XX) || defined (GD32A74XX) */
        default:
            break;
              }
         }
    }
    return reval;
}

/*!
    \brief      initialize LIN peripheral parameter structure (API_ID(0x0002U))
    \param[in]  initpara: pointer to linflexd_lin_parameter_struct structure
    \param[out] none
    \retval     none
*/
void linflexd_lin_struct_para_init(linflexd_lin_parameter_struct *initpara)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_VALID_POINTER(initpara)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0002U), ERR_PARAM_POINTER);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        initpara->baudRate = DEFAULT_BAUDRATE;
        initpara->ismaster = LINFlexD_MASTER;
        initpara->breakLength = LINFlexD_BREAK_13_BIT;
        initpara->autobaudEnable = SET;
        initpara->responseTimeoutValue = DEFAULT_RES_TIMEOUT_VALUE;
        initpara->headerTimeoutValue = DEFAULT_HEAD_TIMEOUT_VALUE;
        initpara->filterCount = DEFAULT_FILTER_COUNT_VALUE;
        initpara->slaveFilterCfgPtr = NULL;
        initpara->classicID = NULL;
        initpara->numOfClassicID = DEFAULT_NUM_CLASSICID_VALUE;
        initpara->linStatecaputure = LINFLEXD_STATE_CAPTURE_ENABLE;
        initpara->checksumCalculaton = LINFLEXD_CHECKSUM_CALC_ENABLE;
        initpara->checksumField = LINFLEXD_CHECKSUM_FIELD_ENABLE;
        initpara->automaticWakeUp = LINFLEXD_WAKEUP_HARDWARE_CLEAR;
        initpara->bypassFilter = BYPASS_LINFLEXD_FILTER_ENABLE;
        initpara->slaveSyncLength = LINFLEXD_SLAVE_BREAK_10_BIT;
        initpara->receiverBufferLock = LINFLEXD_RECEIVER_BUFFER_LOCKED;
    }

