sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_lin.c
}

/*!
    \brief      initialize LIN peripheral (API_ID(0x0003U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  initpara: LIN parameter initialization struct, members and values:
                  baudRate              : LIN communication baudrate (uint32_t)
                  ismaster              : LINFlexD_SLAVE, LINFlexD_MASTER
                  breakLength           : LINFlexD_BREAK_10_BIT, LINFlexD_BREAK_11_BIT, ..., LINFlexD_BREAK_50_BIT
                  autobaudEnable        : SET, RESET
                  responseTimeoutValue  : 0x00~0x0F
                  headerTimeoutValue    : 0x00~0x7F
                  filterCount           : 0~15
                  slaveFilterCfgPtr     : pointer to linflexd_lin_id_filter_struct array
                  classicID             : pointer to uint8_t array of classic checksum IDs
                  numOfClassicID        : number of classic checksum IDs (uint8_t)
                  linStatecaputure      : LINFLEXD_STATE_CAPTURE_DISABLE , LINFLEXD_STATE_CAPTURE_ENABLE
                  checksumCalculaton    : LINFLEXD_CHECKSUM_CALC_ENABLE , LINFLEXD_CHECKSUM_CALC_DISABLE
                  checksumField         : LINFLEXD_CHECKSUM_FIELD_ENABLE , LINFLEXD_CHECKSUM_FIELD_DISABLE
                  automaticWakeUp       : LINFLEXD_AUTOSYNC_DISABLE , LINFLEXD_AUTOSYNC_ENABLE
                  bypassFilter          : BYPASS_LINFLEXD_FILTER_DISABLE , BYPASS_LINFLEXD_FILTER_ENABLE
                  slaveSyncLength       : LINFLEXD_SLAVE_BREAK_11_BIT , LINFLEXD_SLAVE_BREAK_10_BIT
                  receiverBufferLock    : LINFLEXD_RECEIVER_BUFFER_NORMAL , LINFLEXD_RECEIVER_BUFFER_LOCKED
    \param[out]  none
    \retval      ErrStatus:SUCCESS or ERROR
*/
ErrStatus linflexd_lin_init(uint32_t lin_periph, linflexd_lin_parameter_struct *initpara)
{
    ErrStatus reval = SUCCESS;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0003U), ERR_PERIPH);
    } else if(NOT_VALID_POINTER(initpara)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0003U), ERR_PARAM_POINTER);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg;
        uint32_t timeout_cnt;
        timeout_cnt = 0xFFFFU;
        /* enter init mode */
        linflexd_lin_enter_init_mode(lin_periph);
        /* enter init mode */
        while ((linflexd_lin_get_state(lin_periph) != LINFlexD_STATE_INIT_MODE)  && (0U != timeout_cnt)) {
            timeout_cnt--;
        }
        if(linflexd_lin_get_state(lin_periph) != LINFlexD_STATE_INIT_MODE){
            /* set error status */
            reval = ERROR;
        } else {
            /* lin init */
            /* configure LIN state capture */
            LINFLEXD_LINCR1(lin_periph) &= ~(LINFLEXD_LINCR1_NLSE);
            LINFLEXD_LINCR1(lin_periph) |= (LINFLEXD_LINCR1_NLSE & initpara->linStatecaputure);
            /* configure LIN automatic wake up */
            LINFLEXD_LINCR1(lin_periph) &= ~(LINFLEXD_LINCR1_AUTOWU);
            LINFLEXD_LINCR1(lin_periph) |= (LINFLEXD_LINCR1_AUTOWU & initpara->automaticWakeUp);
            /* configure LIN bypass filter */
            LINFLEXD_LINCR1(lin_periph) &= ~(LINFLEXD_LINCR1_BF);
            LINFLEXD_LINCR1(lin_periph) |= (LINFLEXD_LINCR1_BF & initpara->bypassFilter);
            /* configure LIN slave sync length */
            LINFLEXD_LINCR1(lin_periph) &= ~(LINFLEXD_LINCR1_SSBL);
            LINFLEXD_LINCR1(lin_periph) |= (LINFLEXD_LINCR1_SSBL & initpara->slaveSyncLength);
            /* configure LIN receiver buffer lock */
            LINFLEXD_LINCR1(lin_periph) &= ~(LINFLEXD_LINCR1_RBLM);
            LINFLEXD_LINCR1(lin_periph) |= (LINFLEXD_LINCR1_RBLM & initpara->receiverBufferLock);
            /* configure LIN checksum calculaton */
            LINFLEXD_LINCR1(lin_periph) &= ~(LINFLEXD_LINCR1_CCD);
            LINFLEXD_LINCR1(lin_periph) |= (LINFLEXD_LINCR1_CCD & initpara->checksumCalculaton);
            /* configure LIN checksum field */
            LINFLEXD_LINCR1(lin_periph) &= ~(LINFLEXD_LINCR1_CFD);
            LINFLEXD_LINCR1(lin_periph) |= (LINFLEXD_LINCR1_CFD & initpara->checksumField);
                
            /* set break length */
            reg = LINFLEXD_LINCR1(lin_periph);
            reg &= ~LINFLEXD_LINCR1_MBL;
            reg |= ((uint32_t)initpara->breakLength << 8U) & LINFLEXD_LINCR1_MBL;
            LINFLEXD_LINCR1(lin_periph) = reg;
            if(initpara->ismaster == LINFlexD_MASTER) {
                linflexd_lin_master_mode_enable(lin_periph);
            } else {
                linflexd_lin_master_mode_disable(lin_periph);
            }
            
            /* configure filter if needed */
            if((initpara->filterCount > 0U) && (initpara->slaveFilterCfgPtr != NULL)) {
                linflexd_lin_config_id_filter(lin_periph, initpara->filterCount, initpara->slaveFilterCfgPtr);
            } else {
                /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
            }
            
            /* set timeout value */
            linflexd_lin_timeout_disable(lin_periph);
            linflexd_lin_set_timeout_value(lin_periph, initpara->responseTimeoutValue, initpara->headerTimeoutValue);
             /* if autobaud is enabled */
            if ((initpara->autobaudEnable==SET) && (initpara->ismaster == LINFlexD_SLAVE))
            {
                /* always detect LIN Break from Master */
                linflexd_lin_auto_sync_enable(lin_periph);
            }
            
            /* set baudrate */
            linflexd_lin_baudrate_set(lin_periph, initpara->baudRate);
            /* Disable Idle on Bit Error */
            linflexd_lin_idle_bit_error_disable(lin_periph);
            /* exit init mode */
            linflexd_lin_enter_normal_mode(lin_periph);
        }
    }
    return reval;
}

/*!
    \brief      set the baud rate of the LIN module (API_ID(0x0004U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  baudval: baudrate value
    \param[out] none
    \retval     none
    \note       This function may contain scenarios leading to an infinite loop.
                Modify it according to the actual usage requirements.
*/
void linflexd_lin_baudrate_set(uint32_t lin_periph, uint32_t baudval)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0004U), ERR_PERIPH);
    } else if(NOT_LINFLEXD_LIN_BAUDRATE(baudval)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0004U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t uclk;
        float prescaler, fraction, floatNumerator;
        uint32_t mantissa, fractionDenominator;
        uint8_t fractionNumerator;
        uint8_t init_mode_entered = 0U;
        uint32_t timeout_cnt;
        timeout_cnt = 0xFFFFU;
        
