sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_lin.c
        /* get LIN peripheral clock frequency, user should implement this function as needed */
        uclk = rcu_clock_freq_get(CK_LINFLEXD);
        /* Compute divider and fraction */
        prescaler = (float)uclk / ((float)baudval * 16.0f); 
        mantissa = (uint32_t)prescaler;
        fraction = prescaler - (float)mantissa;
        fractionDenominator = ((uint32_t)1U << (uint32_t)BAUDRATE_FRACTION_WIDTH); 
        floatNumerator = (fraction * (float)fractionDenominator) + 0.5f;
        fractionNumerator = (uint8_t)floatNumerator;
        
        if(fractionNumerator == fractionDenominator) {
            fractionNumerator = 0U;
            mantissa++;
        } else {
            /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
        }
        
        /* Enter init mode if not already */
        if((linflexd_lin_get_state (lin_periph) != LINFlexD_STATE_INIT_MODE)) {
            linflexd_lin_enter_init_mode(lin_periph);
            while ((linflexd_lin_get_state(lin_periph) != LINFlexD_STATE_INIT_MODE)  && (0U != timeout_cnt)) {
                timeout_cnt--;
            }
            init_mode_entered = 1U;
        } else {
            /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
        }
        
        /* Set baudrate registers */
        linflexd_lin_set_integer_baudrate(lin_periph,mantissa);
        linflexd_lin_set_fractional_baudrate(lin_periph,fractionNumerator);
        
        /* Restore normal mode if we entered init mode */
        if(init_mode_entered == 1U) {
            linflexd_lin_enter_normal_mode(lin_periph);
        } else {
            /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
        }
    }
}

/*!
    \brief      set integer part of LIN baudrate register (API_ID(0x0005U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  ibr: integer baudrate value
    \param[out] none
    \retval     none
*/
void linflexd_lin_set_integer_baudrate(uint32_t lin_periph, uint32_t ibr)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0005U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t regValTemp = LINFLEXD_LINIBRR(lin_periph);
        regValTemp &= ~LINFLEXD_LINIBRR_IBR;
        regValTemp |= (ibr & (LINFLEXD_LINIBRR_IBR));
        LINFLEXD_LINIBRR(lin_periph) = regValTemp;
    }
}

/*!
    \brief      set fractional part of LIN baudrate register (API_ID(0x0006U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  fbr: fractional baudrate value
    \param[out] none
    \retval     none
*/
void linflexd_lin_set_fractional_baudrate(uint32_t lin_periph, uint8_t fbr)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0006U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t regValTemp = LINFLEXD_LINFBRR(lin_periph);
        regValTemp &= ~LINFLEXD_LINFBRR_FBR;
        regValTemp |= (fbr & (LINFLEXD_LINFBRR_FBR) );
        LINFLEXD_LINFBRR(lin_periph) = regValTemp;
    }
}

/*!
    \brief      LIN transmit data  (API_ID(0x0007U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  data: pointer to data buffer
    \param[in]  size: data length (1~8)
    \param[out] none
    \retval     none
*/
void linflexd_lin_data_transmit(uint32_t lin_periph, uint8_t *data, uint8_t size)
{
    uint8_t i ;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0007U), ERR_PERIPH);
    } else if(NOT_VALID_POINTER(data)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0007U), ERR_PARAM_POINTER);
    } else if(NOT_LINFLEXD_LIN_DATA_LENGTH_SIZE(size)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0007U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t tmp_val[2] = {0U};
        uint32_t data_32b ;
        
        if(size <= 4U) {
            for(i = 0U; i < size; i++) {
                data_32b = data[i];
                tmp_val[0] |= (data_32b << (8U * i));
            }
            LINFLEXD_BDRL(lin_periph) = tmp_val[0];
        } else {
            /* first 4 bytes */
            tmp_val[0] = ((uint32_t)data[0]) |
                         ((uint32_t)data[1] << 8U) |
                         ((uint32_t)data[2] << 16U) |
                         ((uint32_t)data[3] << 24U);
            /* remaining bytes */
            for(i = 4U; i < size; i++) {
                data_32b = data[i];
                tmp_val[1] |= (data_32b << (8U * (i - 4U)));
            }
            LINFLEXD_BDRL(lin_periph) = tmp_val[0];
            LINFLEXD_BDRM(lin_periph) = tmp_val[1];
        }
    }
}

/*!
    \brief      LIN receive data (API_ID(0x0008U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] data: pointer to data buffer
    \param[in]  size: data length (1~8)
    \retval     none
*/
void linflexd_lin_data_receive(uint32_t lin_periph, uint8_t *data, uint8_t size)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0008U), ERR_PERIPH);
    } else if(NOT_VALID_POINTER(data)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0008U), ERR_PARAM_POINTER);
    } else if(NOT_LINFLEXD_LIN_DATA_LENGTH_SIZE(size)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0008U), ERR_PARAM_INVALID);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint8_t i ;
        uint32_t tmp_val[2] = {0U};
        
        tmp_val[0] = LINFLEXD_BDRL(lin_periph);
        tmp_val[1] = LINFLEXD_BDRM(lin_periph);
        
        if(size <= 4U) {
            for(i = 0U; i < size; i++) {
                data[i] = (uint8_t)((tmp_val[0] >> (i * 8U)) & 0xFFU);
            }
        } else {
            /* first 4 bytes */
            data[0] = (uint8_t)(tmp_val[0] & 0xFFU);
            data[1] = (uint8_t)((tmp_val[0] >> 8U) & 0xFFU);
            data[2] = (uint8_t)((tmp_val[0] >> 16U) & 0xFFU);
            data[3] = (uint8_t)((tmp_val[0] >> 24U) & 0xFFU);
            /* remaining bytes */
            for(i = 4U; i < size; i++) {
                data[i] = (uint8_t)((tmp_val[1] >> ((i - 4U) * 8U)) & 0xFFU);
            }
        }
    }
}

/*!
    \brief      get LIN checksum (API_ID(0x0009U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     uint8_t: checksum value
*/
uint8_t linflexd_lin_get_checksum(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0009U), ERR_PERIPH);
        return 0U;
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        return (uint8_t)(LINFLEXD_LINCFR(lin_periph) & 0xFFU);
    }
}

/*!
    \brief      LIN module enters initialization mode (API_ID(0x000AU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_enter_init_mode(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x000AU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINCR1(lin_periph) &= ~LINFLEXD_LINCR1_SLEEP;
        LINFLEXD_LINCR1(lin_periph) |= LINFLEXD_LINCR1_INIT;
    }
}

/*!
    \brief      LIN module enters normal operation mode (API_ID(0x000BU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_enter_normal_mode(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x000BU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINCR1(lin_periph) &= ~LINFLEXD_LINCR1_SLEEP;
        LINFLEXD_LINCR1(lin_periph) &= ~LINFLEXD_LINCR1_INIT;
    }
}

/*!
    \brief      set LIN module to enter or exit sleep mode (API_ID(0x000CU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  enable: 1 to enter sleep, 0 to exit sleep
    \param[out] none
    \retval     none
*/
void linflexd_lin_set_sleep_mode(uint32_t lin_periph, uint8_t enable)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x000CU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != enable) {
            LINFLEXD_LINCR1(lin_periph) |= LINFLEXD_LINCR1_SLEEP;
        } else {
            LINFLEXD_LINCR1(lin_periph) &= ~LINFLEXD_LINCR1_SLEEP;
        }
    }
}

/*!
    \brief      get LIN module sleep mode (API_ID(0x000DU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus linflexd_lin_get_sleep_mode(uint32_t lin_periph)
{
    FlagStatus ret = RESET;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x000DU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (LINFLEXD_LINCR1(lin_periph) & LINFLEXD_LINCR1_SLEEP)) {
            ret = SET;
        } else {
            ret = RESET;
        }
    }
    return ret;
}

/*!
    \brief      enable LIN module auto synchronization (API_ID(0x000EU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_auto_sync_enable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x000EU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINCR1(lin_periph) |= LINFLEXD_LINCR1_LASE;
    }
}

/*!
    \brief      disable LIN module auto synchronization (API_ID(0x000FU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_auto_sync_disable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x000FU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
      LINFLEXD_LINCR1(lin_periph) &= ~LINFLEXD_LINCR1_LASE;
    }
}

/*!
    \brief      enable LIN module loopback mode (API_ID(0x0010U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_loopback_enable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0010U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg;
        reg = LINFLEXD_LINCR1(lin_periph);
        /* enter loopback mode */
        reg |= LINFLEXD_LINCR1_LBKM;
        LINFLEXD_LINCR1(lin_periph) = reg;
    }
}

/*!
    \brief      disable LIN module loopback mode (API_ID(0x0011U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_loopback_disable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0011U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg;
        reg = LINFLEXD_LINCR1(lin_periph);
        /* exit loopback mode */
        reg &= ~LINFLEXD_LINCR1_LBKM;
        LINFLEXD_LINCR1(lin_periph) = reg;
    }
}

/*!
    \brief      configure LIN module transfer direction (API_ID(0x0012U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  dir: transfer direction, refer to linflexd_lin_direction_enum
                    only one parameter can be selected which is shown as below:
      \arg        LINFlexD_RX: receive frames in LIN
      \arg        LINFlexD_TX: transmit frames in LIN
    \param[out] none
    \retval     none
*/
void linflexd_lin_set_direction(uint32_t lin_periph, linflexd_lin_direction_enum dir)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0012U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(LINFlexD_TX == dir) {
            LINFLEXD_BIDR(lin_periph) |= LINFLEXD_BIDR_DIR;
        } else {
            LINFLEXD_BIDR(lin_periph) &= ~LINFLEXD_BIDR_DIR;
        }
    }
}

/*!
    \brief      configure LIN module transfer data length (API_ID(0x0013U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  size: data length (0~8)
    \param[out] none
    \retval     none
*/
void linflexd_lin_set_data_length(uint32_t lin_periph, uint32_t size)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0013U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_BIDR(lin_periph) &= ~LINFLEXD_BIDR_DFL;
        LINFLEXD_BIDR(lin_periph) |= ((uint32_t)(size-1U) << LINFlexD_BIDR_SIZE_OFFSET) & LINFLEXD_BIDR_DFL;
    }
}

/*!
    \brief      configure LIN module identifier filter (API_ID(0x0014U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  id: 0x0-0x3F
    \param[in]  size: data length 0-8
    \param[in]  dir
                only one parameter can be selected which is shown as below:
      \arg        LINFlexD_RX: receive frames in LIN
      \arg        LINFlexD_TX: transmit frames in LIN
    \param[in]  ccs
                only one parameter can be selected which is shown as below:
      \arg        LIN_ENHANCED_CHECKSUM: enhanced checksum
      \arg        LIN_CLASSIC_CHECKSUM: classic checksum
    \param[out] none
    \retval     none
*/
void linflexd_lin_set_bidr(uint32_t lin_periph, uint8_t id, uint32_t size, linflexd_lin_direction_enum dir, linflexd_lin_checksum_enum ccs)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0014U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t reg = 0U;
        reg |= ((uint32_t)id & 0x3FU);
        reg |= ((uint32_t)ccs << 8U) & LINFLEXD_BIDR_CCS;
        reg |= ((uint32_t)dir << 9U) & LINFLEXD_BIDR_DIR;
        reg |= ((uint32_t)(size-1U) << 10U) & LINFLEXD_BIDR_DFL;
        LINFLEXD_BIDR(lin_periph) = reg;
    }
}

/*!
    \brief      enable header transfer request (API_ID(0x0015U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_header_request_enable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0015U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINCR2(lin_periph) |= LINFLEXD_LINCR2_HTRQ;
    }
}

/*!
    \brief      enable data transfer request (API_ID(0x0016U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_data_request_enable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0016U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINCR2(lin_periph) |= LINFLEXD_LINCR2_DTRQ;
    }
}

/*!
    \brief      enable LIN module wakeup request (API_ID(0x0017U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_wakeup_request_enable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0017U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
     {
         LINFLEXD_LINCR2(lin_periph) |= LINFLEXD_LINCR2_WURQ;
     }
}

/*!
    \brief      config LINFlexD_LIN auto wakeup hardware to clear the SLEEP bit (API_ID(0x0018U))
    \param[in]  lin_periph: LINFLEXD_LINx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_autowake_hw_clear(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0018U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;
        reg = LINFLEXD_LINCR1(lin_periph);
        /* set hardware clear SLEEP bit */
        reg |= LINFLEXD_LINCR1_AUTOWU;
        LINFLEXD_LINCR1(lin_periph) = reg;
    }
}

/*!
    \brief      config LINFlexD_LIN auto wakeup software to clear the SLEEP bit (API_ID(0x0019U))
    \param[in]  lin_periph: LINFLEXD_LINx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_autowake_sw_clear(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0019U), ERR_PERIPH);
    } else
#endif
    {
        uint32_t reg;
        reg = LINFLEXD_LINCR1(lin_periph);
        /* set software clear SLEEP bit */
        reg &= ~LINFLEXD_LINCR1_AUTOWU;
        LINFLEXD_LINCR1(lin_periph) = reg;
    }
}

/*!
    \brief      enable LIN module data discard request (API_ID(0x001AU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_data_discard_enable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x001AU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINCR2(lin_periph) |= LINFLEXD_LINCR2_DDRQ;
    }
}

/*!
    \brief      enable idle on bit error for LIN module (API_ID(0x001BU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_idle_bit_error_enable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x001BU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINCR2(lin_periph) |= LINFLEXD_LINCR2_IOBE;
    }
}

/*!
    \brief      disable idle on bit error for LIN module (API_ID(0x001CU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_idle_bit_error_disable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x001CU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINCR2(lin_periph) &= ~LINFLEXD_LINCR2_IOBE;
    }
}

/*!
    \brief      enable idle on parity error for LIN module (API_ID(0x001DU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_idle_parity_error_enable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x001DU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINCR2(lin_periph) |= LINFLEXD_LINCR2_IOPE;
    }
}

/*!
    \brief      disable idle on parity error for LIN module (API_ID(0x001EU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_idle_parity_error_disable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x001EU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINCR2(lin_periph) &= ~LINFLEXD_LINCR2_IOPE;
    }
}

/*!
    \brief      enable LIN module transfer abort request (API_ID(0x001FU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_transfer_abort_enable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x001FU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINCR2(lin_periph) |= LINFLEXD_LINCR2_ABRQ;
    }
}

/*!
    \brief      get LIN transfer abort status (API_ID(0x0020U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     uint8_t: 1 if abort requested, 0 otherwise
*/
uint8_t linflexd_lin_get_transfer_abort(uint32_t lin_periph)
{
    uint8_t ret = 0U ;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0020U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (LINFLEXD_LINCR2(lin_periph) & LINFLEXD_LINCR2_ABRQ)) {
            ret = 1U;
        } else {
            ret = 0U;
        }
    }
    return ret;
}

/*!
    \brief      set ID in LIN BIDR register (API_ID(0x0021U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  id: 0x0-0x3F
    \param[out] none
    \retval     none
*/
void linflexd_lin_set_bidr_id(uint32_t lin_periph, uint8_t id)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0021U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_BIDR(lin_periph) = (LINFLEXD_BIDR(lin_periph) & ~LINFLEXD_BIDR_ID) | ((uint32_t)id & 0x3FU);
    }
}

/*!
    \brief      get ID in LIN BIDR register (API_ID(0x0022U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     uint8_t: ID value
*/
uint8_t linflexd_lin_get_bidr_id(uint32_t lin_periph)
{
    uint8_t temp = 0U;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0022U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        temp = (uint8_t)(LINFLEXD_BIDR(lin_periph) & LINFlexD_BIDR_ID_MASK);
    }
    return temp;
}

/*!
    \brief      enable LIN master mode (API_ID(0x0023U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_master_mode_enable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0023U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINCR1(lin_periph) |= LINFLEXD_LINCR1_MME;
    }
}

/*!
    \brief      disable LIN master mode (API_ID(0x0024U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_master_mode_disable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0024U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINCR1(lin_periph) &= ~LINFLEXD_LINCR1_MME;
    }
}

/*!
    \brief      get current working state of LIN (API_ID(0x0025U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     linflexd_lin_hw_state_enum: LIN hardware state
*/
linflexd_lin_hw_state_enum linflexd_lin_get_state(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0025U), ERR_PERIPH);
        return LINFlexD_STATE_IDLE_MODE;
    }
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t state = (LINFLEXD_LINSR(lin_periph) & LINFLEXD_LINSR_LINS) >> 12U;
        return (linflexd_lin_hw_state_enum)state;
    }
}

