sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_lin.c
/*!
    \brief      enable timeout (API_ID(0x0026U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_timeout_enable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0026U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINTCSR(lin_periph) &= ~ LINFLEXD_LINTCSR_MODE;
        LINFLEXD_LINTCSR(lin_periph) = (LINFLEXD_LINTCSR_IOT | LINFLEXD_LINTCSR_TOCE);
    }
}

/*!
    \brief      disable timeout (API_ID(0x0027U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_timeout_disable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0027U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINTCSR(lin_periph) &= ~ (LINFLEXD_LINTCSR_IOT | LINFLEXD_LINTCSR_TOCE);
        LINFLEXD_LINTCSR(lin_periph) = LINFLEXD_LINTCSR_MODE;
    }
}

/*!
    \brief      set timeout value (API_ID(0x0028U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  responseTimeout:  timeout value:0x00-0x0F
    \param[in]  headerTimeout: header timeout value:0x00-0x7F
    \param[out] none
    \retval     none
*/
void linflexd_lin_set_timeout_value(uint32_t lin_periph, uint8_t responseTimeout, uint8_t headerTimeout)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0028U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINTOCR(lin_periph) = ((uint32_t)responseTimeout << 8U) | ((uint32_t)headerTimeout & 0x7FU);
    }
}

/*!
    \brief      set oc value (API_ID(0x0029U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  oc1: output compare value 1:0xFFU
    \param[in]  oc2: output compare value 2:0xFFU
    \param[out] none
    \retval     none
*/
void linflexd_lin_set_oc_value(uint32_t lin_periph, uint8_t oc1, uint8_t oc2)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0029U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINOCR(lin_periph) = ((uint32_t)oc2 << 8U) | ((uint32_t)oc1 & 0xFFU);
    }
}

/*!
    \brief      configure LIN identifier filter (API_ID(0x002AU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  filterCount: number of filters
    \param[in]  config: pointer to linflexd_lin_id_filter_struct array
                and the member values are shown as below:
                filterEnable: SET, RESET
                maskEnable: 0U,1U
                dataFieldLength: 0-7
                direction: LINFlexD_RX, LINFlexD_TX
                checksumType: LIN_ENHANCED_CHECKSUM, LIN_CLASSIC_CHECKSUM
                id: 0x0-0x3F
                data:LIN Data pointer
    \param[out] none
    \retval     none
*/
void linflexd_lin_config_id_filter(uint32_t lin_periph, uint8_t filtercount, linflexd_lin_id_filter_struct *config)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x002AU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        uint32_t i,ifer = 0U, ifmr = 0U;
        for(i = 0U; i < filtercount; i++) {
            if (SET==config[i].filterEnable) {
            ifer |= ((uint32_t)1U << i); 
            ifmr |= (uint32_t)config[i].maskEnable << (i / 2U);
            LINFLEXD_IFCR(lin_periph, i) = ((uint32_t)((config[i].dataFieldLength)-1U) << 10U) |
                                           ((uint32_t)(config[i].direction) << 9U) |
                                           ((uint32_t)(config[i].checksumType) << 8U) |
                                           ((uint32_t)(config[i].id) & 0x3FU);
            LINFLEXD_LINCR1(lin_periph) &= ~LINFlexD_LINCR1_BF_MASK;
            } else {
                /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
            }
        }
        LINFLEXD_IFER(lin_periph) |= ifer;
        LINFLEXD_IFMR(lin_periph) |= ifmr;
    }
}

/*!
    \brief      get identifier filter match index (API_ID(0x002BU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     uint8_t: filter match index
*/
uint8_t linflexd_lin_get_filter_match_index(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x002BU), ERR_PERIPH);
        return 0U;
    }
#endif /* FW_DEBUG_ERR_REPORT */
    {
        return (uint8_t)(LINFLEXD_IFMI(lin_periph) & LINFlexD_IFMI_IFMI_MASK);
    }
}

/*!
    \brief      set byte order msb enable for LIN data transmission (API_ID(0x002CU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_tx_order_msb_enable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x002CU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_GCR(lin_periph) |= LINFLEXD_GCR_TDFBM;
    }
}

/*!
    \brief      set byte order msb disable for LIN data transmission (API_ID(0x002DU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_tx_order_msb_disable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x002DU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_GCR(lin_periph) &= ~ LINFLEXD_GCR_TDFBM;
    }
}

/*!
    \brief      set byte order msb enable for LIN data reception (API_ID(0x002EU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_rx_order_msb_enable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x002EU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_GCR(lin_periph) |= LINFLEXD_GCR_RDFBM;
    }
}

/*!
    \brief      set byte order msb disable for LIN data reception (API_ID(0x002FU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_rx_order_msb_disable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x002FU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_GCR(lin_periph) &= ~ LINFLEXD_GCR_RDFBM;
    }
}

/*!
    \brief      configure number of stop bits for LIN (API_ID(0x0030U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  stopBits: 0 for 1 stop bit, 1 for 2 stop bits
    \param[out] none
    \retval     none
*/
void linflexd_lin_stop_bit_config(uint32_t lin_periph, uint8_t stopBits)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0030U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != stopBits) {
            LINFLEXD_GCR(lin_periph) |= LINFLEXD_GCR_STOP;
        } else {
            LINFLEXD_GCR(lin_periph) &= ~LINFLEXD_GCR_STOP;
        }
    }
}

/*!
    \brief      perform software reset on LIN module enable (API_ID(0x0031U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_soft_reset_enable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0031U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_GCR(lin_periph) |= LINFLEXD_GCR_SR;
    }
}

/*!
    \brief      perform software reset on LIN module disable (API_ID(0x0032U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_soft_reset_disable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0032U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_GCR(lin_periph) &= ~LINFLEXD_GCR_SR;
    }
}

/*!
    \brief      enable LIN signal inversion function (API_ID(0x0033U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_inversion_enable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0033U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_GCR(lin_periph) |= (LINFLEXD_GCR_TDLIS | LINFLEXD_GCR_RDLIS);
    }
}

/*!
    \brief      disable LIN signal inversion function (API_ID(0x0034U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_inversion_disable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0034U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_GCR(lin_periph) &= ~(LINFLEXD_GCR_TDLIS | LINFLEXD_GCR_RDLIS);
    }
}

/*!
    \brief      Two Bit delimiter enable for LIN module (API_ID(0x0035U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void linflexd_lin_two_bit_delimiter_enable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0035U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINCR2(lin_periph) &= ~LINFLEXD_LINCR2_TBDE;
        LINFLEXD_LINCR2(lin_periph) |= LINFLEXD_LINCR2_TBDE;
    }
    
