sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_lin.c
}

/*!
    \brief      Two Bit delimiter disnable for LIN module (API_ID(0x0036U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  none
    \param[out] none
    \retval     none
*/
void linflexd_lin_two_bit_delimiter_disable(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0036U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINCR2(lin_periph) &= ~LINFLEXD_LINCR2_TBDE;
    }
    
}

/*!
    \brief      set LIN module to enter STOP request (API_ID(0x0037U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     none
*/
void linflexd_lin_stop_request_set(uint32_t lin_periph)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0037U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LIN_STCTL(lin_periph) |= LINFLEXD_LIN_STCTL_STOP;
    }
}

/*!
    \brief      get LIN module STOP request acknowledge status (API_ID(0x0038U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[out] none
    \retval     uint8_t: 1 if acknowledged, 0 otherwise
*/
uint8_t linflexd_lin_stop_ack_get(uint32_t lin_periph)
{
    uint8_t ret = 0U ;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0038U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (LINFLEXD_LIN_STCTL(lin_periph) & LINFLEXD_LIN_STCTL_ACK)) {
            ret = 1U;
        } else {
            ret = 0U;
        }
    }
    return ret;
}

/*!
    \brief      enable DMA TX function for LIN (API_ID(0x0039U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  lin_dma_channel: LINFLEXD_DMATX_CHANNELx(x=0..15)
    \param[out] none
    \retval     none
*/
void linflexd_lin_dma_tx_enable(uint32_t lin_periph,linflexd_dma_tx_channel_enum lin_dma_channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0039U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_DMATXE(lin_periph) |= (uint32_t)lin_dma_channel;
    }
}

/*!
    \brief      disable DMA TX function for LIN (API_ID(0x003AU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  lin_dma_channel: LINFLEXD_DMATX_CHANNELx(x=0..15)
    \param[out] none
    \retval     none
*/
void linflexd_lin_dma_tx_disable(uint32_t lin_periph,linflexd_dma_tx_channel_enum lin_dma_channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x003AU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_DMATXE(lin_periph) &= ~(uint32_t)lin_dma_channel;
    }
}

/*!
    \brief      enable DMA RX function for LIN (API_ID(0x003BU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  lin_dma_channel: LINFLEXD_DMARX_CHANNELx(x=0..15)
    \param[out] none
    \retval     none
*/
void linflexd_lin_dma_rx_enable(uint32_t lin_periph,linflexd_dma_rx_channel_enum lin_dma_channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x003BU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_DMARXE(lin_periph) |= (uint32_t)lin_dma_channel;
    }
}

/*!
    \brief      disable DMA RX function for LIN (API_ID(0x003CU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  lin_dma_channel: LINFLEXD_DMARX_CHANNELx(x=0..15)
    \param[out] none
    \retval     none
*/
void linflexd_lin_dma_rx_disable(uint32_t lin_periph,linflexd_dma_rx_channel_enum lin_dma_channel)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x003CU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_DMARXE(lin_periph) &= ~(uint32_t)lin_dma_channel;
    }
}

/*!
    \brief      get LIN status flag (API_ID(0x003DU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  flag: status flag(s) to get
                only one parameter can be selected which is shown as below:
    \arg        LINFLEXD_FLAG_HRF          :header received flag 
    \arg        LINFLEXD_FLAG_DTF          :data transmission completed flag 
    \arg        LINFLEXD_FLAG_DRF          :data reception completed flag 
    \arg        LINFLEXD_FLAG_WUF          :wakeup flag 
    \arg        LINFLEXD_FLAG_RXBUSY       :receiver busy flag 
    \arg        LINFLEXD_FLAG_DRBNE        :data reception buffer not empty flag 
    \arg        LINFLEXD_FLAG_RMB          :release message buffer 
    \arg        LINFLEXD_FLAG_AUTOSYNC_COMP:autosynchronization complete 
    \arg        LINFLEXD_FLAG_NF           :noise flag 
    \arg        LINFLEXD_FLAG_BOF          :buffer overrun flag 
    \arg        LINFLEXD_FLAG_FEF          :framing error flag 
    \arg        LINFLEXD_FLAG_IDPEF        :ID parity error flag  
    \arg        LINFLEXD_FLAG_SDEF         :break delimiter error flag
    \arg        LINFLEXD_FLAG_SFEF         :sync field error flag 
    \arg        LINFLEXD_FLAG_CEF          :checksum error flag 
    \arg        LINFLEXD_FLAG_BEF          :bit error flag 
    \arg        LINFLEXD_FLAG_OCF          :output compare flag 
    \arg        LINFLEXD_FLAG_SZF          :stuck at zero flag 
    \param[out] none
    \retval     uint32_t: status flag
*/
FlagStatus linflexd_lin_flag_get(uint32_t lin_periph, linflexd_flag_enum flag)
{
    FlagStatus reval = RESET ;
    
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x003DU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        if(0U != (LINFLEXD_REG_VAL(lin_periph, flag) & BIT(LINFLEXD_BIT_POS(flag)))) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      clear LIN status flag (API_ID(0x003EU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  flag: status flag(s) to clear
                only one parameter can be selected which is shown as below:
    \arg        LINFLEXD_FLAG_HRF          :header received flag 
    \arg        LINFLEXD_FLAG_DTF          :data transmission completed flag 
    \arg        LINFLEXD_FLAG_DRF          :data reception completed flag 
    \arg        LINFLEXD_FLAG_WUF          :wakeup flag 
    \arg        LINFLEXD_FLAG_RXBUSY       :receiver busy flag 
    \arg        LINFLEXD_FLAG_DRBNE        :data reception buffer not empty flag 
    \arg        LINFLEXD_FLAG_RMB          :release message buffer 
    \arg        LINFLEXD_FLAG_AUTOSYNC_COMP:autosynchronization complete 
    \arg        LINFLEXD_FLAG_NF           :noise flag 
    \arg        LINFLEXD_FLAG_BOF          :buffer overrun flag 
    \arg        LINFLEXD_FLAG_FEF          :framing error flag 
    \arg        LINFLEXD_FLAG_IDPEF        :ID parity error flag  
    \arg        LINFLEXD_FLAG_SDEF         :break delimiter error flag
    \arg        LINFLEXD_FLAG_SFEF         :sync field error flag 
    \arg        LINFLEXD_FLAG_CEF          :checksum error flag 
    \arg        LINFLEXD_FLAG_BEF          :bit error flag 
    \arg        LINFLEXD_FLAG_OCF          :output compare flag 
    \arg        LINFLEXD_FLAG_SZF          :stuck at zero flag 
    \param[out] none
    \retval     none
*/
void linflexd_lin_flag_clear(uint32_t lin_periph, linflexd_flag_enum flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x003EU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_REG_VAL(lin_periph, flag) = BIT(LINFLEXD_BIT_POS((uint32_t)flag));
    }
}

/*!
    \brief      enable interrupt (API_ID(0x003FU))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  interrupt: linflexd interrupt
                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_INT_HRIE  header received interrupt
      \arg        LINFLEXD_INT_DTIE  data transmitted interrupt
      \arg        LINFLEXD_INT_DRIE  data reception complete interrupt
      \arg        LINFLEXD_INT_TOIE  timeout interrupt
      \arg        LINFLEXD_INT_WUIE  wakeup interrupt
      \arg        LINFLEXD_INT_LSIE  LIN state interrupt
      \arg        LINFLEXD_INT_BOIE  buffer overrun interrupt
      \arg        LINFLEXD_INT_FEIE  frame error interrupt
      \arg        LINFLEXD_INT_HEIE  header error interrupt
      \arg        LINFLEXD_INT_CEIE  checksum error interrupt
      \arg        LINFLEXD_INT_BEIE  bit error interrupt
      \arg        LINFLEXD_INT_OCIE  output compare interrupt
      \arg        LINFLEXD_INT_SZIE  stuck at zero interrupt
    \param[out] none
    \retval     none
*/
void linflexd_lin_interrupt_enable(uint32_t lin_periph, linflexd_interrupt_enum interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x003FU), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINIER(lin_periph) |= (uint32_t)interrupt;
    }
}

/*!
    \brief      disable interrupt (API_ID(0x0040U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  interrupt: linflexd interrupt

                only one parameter can be selected which is shown as below:
      \arg        LINFLEXD_INT_HRIE  header received interrupt
      \arg        LINFLEXD_INT_DTIE  data transmitted interrupt
      \arg        LINFLEXD_INT_DRIE  data reception complete interrupt
      \arg        LINFLEXD_INT_TOIE  timeout interrupt
      \arg        LINFLEXD_INT_WUIE  wakeup interrupt
      \arg        LINFLEXD_INT_LSIE  LIN state interrupt
      \arg        LINFLEXD_INT_BOIE  buffer overrun interrupt
      \arg        LINFLEXD_INT_FEIE  frame error interrupt
      \arg        LINFLEXD_INT_HEIE  header error interrupt
      \arg        LINFLEXD_INT_CEIE  checksum error interrupt
      \arg        LINFLEXD_INT_BEIE  bit error interrupt
      \arg        LINFLEXD_INT_OCIE  output compare interrupt
      \arg        LINFLEXD_INT_SZIE  stuck at zero interrupt
    \param[out] none
    \retval     none
*/
void linflexd_lin_interrupt_disable(uint32_t lin_periph, linflexd_interrupt_enum interrupt)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0040U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_LINIER(lin_periph) &= ~(uint32_t)interrupt;
    }
}

/*!
    \brief      get LIN interrupt flag status (API_ID(0x0041U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  flag: interrupt flag(s) to get
                only one parameter can be selected which is shown as below:
    \arg        LINFLEXD_INT_FLAG_HRF     :header received interrupt and flag 
    \arg        LINFLEXD_INT_FLAG_DTF     :data transmission completed interrupt and flag
    \arg        LINFLEXD_INT_FLAG_DRF     :data reception completed interrupt and flag 
    \arg        LINFLEXD_INT_FLAG_WUF     :wakeup interrupt and flag 
    \arg        LINFLEXD_INT_FLAG_BOF     :buffer overrun interrupt and flag
    \arg        LINFLEXD_INT_FLAG_FEF     :framing error interrupt and flag
    \arg        LINFLEXD_INT_FLAG_IDPEF   :ID parity error interrupt and flag
    \arg        LINFLEXD_INT_FLAG_SDEF    :Sync Break delimiter error interrupt and flag
    \arg        LINFLEXD_INT_FLAG_SFEF    :Sync field error interrupt and flag
    \arg        LINFLEXD_INT_FLAG_CEF     :checksum error interrupt and flag 
    \arg        LINFLEXD_INT_FLAG_BEF     :bit error interrupt and flag 
    \arg        LINFLEXD_INT_FLAG_OCF     :output compare interrupt and flag
    \arg        LINFLEXD_INT_FLAG_SZF     :stuck at zero interrupt and flag
    \param[out] none
    \retval     uint32_t: interrupt flag status
*/
FlagStatus linflexd_lin_interrupt_flag_get(uint32_t lin_periph, linflexd_interrupt_flag_enum flag)
{
    FlagStatus reval = RESET ;
    uint32_t intenable, flagstatus;
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0041U), ERR_PERIPH);
    }else
#endif /* FW_DEBUG_ERR_REPORT */
    {

