sorosaulong-ux/gd32-test-project/Library/gd32a7xx_linflexd_lin.c
        /* get the interrupt enable bit status */
        intenable = (LINFLEXD_REG_VAL2(lin_periph,flag) & BIT(LINFLEXD_BIT_POS2(flag)));
        /* get the corresponding flag bit status */
        flagstatus = (LINFLEXD_REG_VAL(lin_periph,flag) & BIT(LINFLEXD_BIT_POS(flag)));

        if((0U != flagstatus) && (0U != intenable)) {
            reval = SET;
        } else {
            /* this code is written to avoid MISRA 15.7 (no 'else' at end of 'if ... else if' chain) */
        }
    }
    return reval;
}

/*!
    \brief      clear LIN interrupt flag (API_ID(0x0042U))
    \param[in]  lin_periph: LINFLEXDx(x=0..11)
    \param[in]  flag: interrupt flag(s) to clear
                only one parameter can be selected which is shown as below:
    \arg           LINFLEXD_INT_FLAG_HRF        :header received interrupt and flag 
    \arg           LINFLEXD_INT_FLAG_DTF        :data transmission completed interrupt and flag 
    \arg           LINFLEXD_INT_FLAG_DRF        :data reception completed interrupt and flag
    \arg           LINFLEXD_INT_FLAG_WUF        :wakeup interrupt and flag 
    \arg           LINFLEXD_INT_FLAG_BOF        :buffer overrun interrupt and flag
    \arg           LINFLEXD_INT_FLAG_FEF        :framing error interrupt and flag
    \arg           LINFLEXD_INT_FLAG_IDPEF      :ID parity error interrupt and flag
    \arg           LINFLEXD_INT_FLAG_SDEF       :Sync Break delimiter error interrupt and flag
    \arg           LINFLEXD_INT_FLAG_SFEF       :Sync field error interrupt and flag
    \arg           LINFLEXD_INT_FLAG_CEF        :checksum error interrupt and flag 
    \arg           LINFLEXD_INT_FLAG_BEF        :bit error interrupt and flag 
    \arg           LINFLEXD_INT_FLAG_OCF        :output compare interrupt and flag
    \arg           LINFLEXD_INT_FLAG_SZF        :stuck at zero interrupt and flag
    \param[out] none
    \retval     none
*/
void linflexd_lin_interrupt_flag_clear(uint32_t lin_periph, linflexd_interrupt_flag_enum flag)
{
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_LINFLEXD_LIN_PERIPH(lin_periph)) {
        fw_debug_report_err(LIN_MODULE_ID, API_ID(0x0042U), ERR_PERIPH);
    } else
#endif /* FW_DEBUG_ERR_REPORT */
    {
        LINFLEXD_REG_VAL(lin_periph, flag) = BIT(LINFLEXD_BIT_POS((uint32_t)flag));
    }
}
